Revit 2026 API

# BarTerminationsData Constructor

---

Creates a new instance of BarTerminationData with the default values.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BarTerminationsData(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
BarTerminationsData(
	Document^ document
)
```
```fsharp
new :
        document : Document -> BarTerminationsData
```

#### Parameters

document Document
     The document containing the hook type ids, end treatment ids and crank type ids.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

BarTerminationsData Class

Autodesk.Revit.DB.Structure Namespace